app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT  DISTINCT "candidates".* FROM "candidates" WHERE ("candidates"."name" LIKE '%t%') LIMIT ?  [["LIMIT", 2]]
---
  def search
   @candidates = Candidate.ransack(name_cont: params[:q]).result(distinct: true).limit(2)

INSERT INTO "candidates" ("name", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save

UPDATE "candidates" SET "description" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["description", ""], ["updated_at", "2018-01-22 18:42:09.447334"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @candidate.update(candidate_params)

DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
  def destroy
    @candidate.destroy

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_candidate
      @candidate = Candidate.find(params[:id])